import unittest

from merge_playlist.merge import channel_name_participle, SimilarIndex, DEFAULT_SIMILAR_THRESHOLD


class MyTestCase(unittest.TestCase):
    def test_channel_name_participle(self):
        w1 = channel_name_participle('CCTV-5+ 体育赛事 HD')
        w2 = channel_name_participle('CCTV-15 音乐')
        w3 = channel_name_participle('CCTV-8 电视剧 FHD')
        w4 = channel_name_participle('东南卫视')
        w5 = channel_name_participle('福建东南卫视')
        w6 = channel_name_participle('凤凰卫视')
        w7 = channel_name_participle('凤凰 中文 移动1')
        w8 = channel_name_participle('民视 3')
        w9 = channel_name_participle('民视3')
        self.assertEqual(w6, ['凤凰', '中文'])
        self.assertEqual(w7, ['凤凰', '中文'])
        self.assertEqual(w8, ['民视'])
        self.assertEqual(w9, ['民视', '3'])

    def test_find_sims(self):
        index_texts = [['cctv', '-', '1', '综合'], ['cctv', '-', '2', '财经'], ['cctv', '-', '3', '综艺'],
                       ['cctv', '-', '4', '国际'], ['cctv', '-', '5', '体育'], ['cctv', '-', '6'],
                       ['cctv', '-', '7', '军事', '农业'], ['cctv', '-', '8'], ['cctv', '-', '9', '纪录'],
                       ['cctv', '-', '10', '科教'], ['cctv', '-', '11', '戏曲'], ['cctv', '-', '12', '社会', '与', '法'],
                       ['cctv', '-', '13', '新闻'], ['cctv', '-', '14', '少儿'], ['cctv', '-', '15', '音乐'],
                       ['cctv', '-', '5', '+', '体育'], ['cctv', '-', '17', '农村', '农业'], ['湖南卫视'], ['北京', '卫视'],
                       ['浙江', '卫视'], ['江苏', '卫视'], ['东方', '卫视'], ['安徽', '卫视'], ['黑龙江', '卫视'], ['辽宁', '卫视'],
                       ['深圳', '卫视'], ['广东', '卫视'], ['天津', '卫视'], ['湖北', '卫视'], ['山东', '卫视'], ['重庆', '卫视'], ['河南', '卫视'],
                       ['陕西', '卫视'], ['吉林', '卫视'], ['广西', '卫视'], ['河北', '卫视'], ['西藏', '卫视'], ['内蒙古', '卫视'],
                       ['青海', '卫视'], ['四川', '卫视'], ['山西', '卫视'], ['新疆', '卫视'], ['云南', '卫视'], ['江西', '卫视'], ['东南', '卫视'],
                       ['贵州', '卫视'], ['甘肃', '卫视'], ['广东', '体育'], ['tvb', '无线', '新闻台'], ['tvb', '无线', '新闻台'],
                       ['tvb', '无线', '新闻台'], ['tvb', '无线', '新闻台'], ['tvbs', '新闻'], ['tvbs', '新闻'], ['tvbs', '新闻'],
                       ['tvbs', '新闻'], ['tvbs'], ['tvbs'], ['有线', '新闻台'], ['有线', '新闻台'], ['凤凰', '香港'], ['凤凰', '香港'],
                       ['凤凰', '中文'], ['凤凰', '中文'], ['凤凰', '中文'], ['凤凰', '中文'], ['凤凰', '资讯'], ['凤凰', '资讯'], ['凤凰', '资讯'],
                       ['凤凰', '资讯'], ['年代', '新闻'], ['年代', '新闻'], ['非凡', '新闻'], ['非凡', '新闻'], ['非凡', '新闻'], ['非凡', '新闻'],
                       ['三立', '新闻'], ['三立', '新闻'], ['东森', '新闻'], ['东森', '新闻'], ['东森', '新闻'], ['东森', '新闻'],
                       ['中', '天', '新闻'], ['中', '天', '新闻'], ['中', '天', '新闻'], ['壹', '新闻'], ['壹', '新闻'], ['寰宇', '新闻'],
                       ['民视', '新闻'], ['民视', '新闻'], ['东森', '财经'], ['东森', '财经'], ['东森', '财经'], ['寰宇', '财经', '台'],
                       ['耀才', '财经', '台'], ['澳亚', '卫视'], ['澳亚', '卫视'], ['香港', '开', '电视'], ['khs'], ['rthk31'],
                       ['rthk31'], ['rhk32'], ['cnbc'], ['cnbc'], ['cnbc'], ['cnn'], ['cnn'], ['bbc'], ['bbc'],
                       ['foxnews'], ['foxnews'], ['hbo', '原创', '电影'], ['hbo', '原创', '电影'], ['hbo', '家庭'], ['hbo', '家庭'],
                       ['hbo', '强档'], ['hbo', '强档'], ['hbo'], ['hbo'], ['东森', '电影'], ['东森', '电影'], ['东森', '电影'],
                       ['东森', '洋片'], ['靖天', '电影台'], ['龙华', '经典'], ['龙华', '影剧'], ['美亚', '电影'], ['美亚', '电影'],
                       ['星卫', '电影台'], ['星卫', '电影'], ['卫视', '电影台'], ['纬来', '电影台'], ['纬来', '电影台'], ['fox', '电影'],
                       ['fox', '电影'], ['fox', '动作', '电影'], ['fox', '动作', '电影'], ['fox', '动作', '电影'], ['采昌', '影剧'],
                       ['tvb', '星河'], ['tvb', '星河'], ['tvb', '韩剧', '台'], ['華藝', '影剧', '台'], ['三立', '戏剧', '台'],
                       ['纬来', '电影'], ['纬来', '戏剧'], ['纬来', '戏剧'], ['纬来', '戏剧'], ['eyetv', '戏剧', '台'], ['凤凰', '电影台'],
                       ['凤凰', '电影台'], ['warnertv'], ['axn'], ['axn'], ['fx'], ['blueant'], ['好莱坞', '电影'], ['chc', '电影'],
                       ['chc', '家庭', '电影'], ['chc', '动作', '电影'], ['tvb', 'j2', '-'], ['tvb', '明珠', '台'],
                       ['tvb', '明珠', '台'], ['tvb', '翡翠台'], ['tvb', '翡翠台'], ['tvb', '翡翠台'], ['tvbs', '欢乐', '台'],
                       ['tvbs', '欢乐', '台'], ['tvbs', '欢乐', '台'], ['tvbs', '欢乐', '台'], ['tvbs', '精采', '台'],
                       ['tvbs', '精采', '台'], ['tvbs', '精采', '台'], ['tvbs', '精采', '台'], ['公视'], ['公视'], ['民视', '台湾', '台'],
                       ['公視', '3'], ['中视', '经典'], ['民视'], ['民视'], ['民视'], ['中视'], ['中视'], ['中视'], ['三立', '都', '会'],
                       ['三立', '台湾'], ['八大', '综合'], ['八大', '综合'], ['八大', '第一'], ['八大', '第一'], ['jet', '综合'],
                       ['jet', '综合'], ['三立', '综合', '台'], ['中', '天', '综合'], ['中', '天', '综合'], ['中', '天', '亚洲'],
                       ['壹', '综合'], ['东森', '综合'], ['东森', '综合'], ['星空', '卫视'], ['tvn'], ['星卫', '娱乐'],
                       ['foxsport', '-', '3'], ['elta', '体育'], ['elta', '体育'], ['elta', '体育', '2'], ['elta', '体育', '3'],
                       ['博斯', '高球', '1'], ['博斯', '高球', '1'], ['博斯', '高球', '1'], ['博斯', '高球', '2'], ['纬来', '体育'],
                       ['纬来', '体育'], ['z', '频道'], ['star', 'sports'], ['国家', '地理', '野生'], ['国家', '地理', '野生'],
                       ['国家', '地理'], ['国家', '地理'], ['国家', '地理'], ['探索频道'], ['探索', '亚洲'], ['探索', '亚洲'], ['探索', '科学'],
                       ['探索', '科学'], ['动物', '星球'], ['动物', '星球'], ['动物', '星球'], ['动物', '星球'], ['tlc', '旅游', '生活'],
                       ['tlc', '旅游', '生活'], ['亚洲', '旅游', '台'], ['年代', 'much'], ['年代', 'much'], ['美食', '星球'], ['smart'],
                       ['mtv'], ['ftv'], ['fashion'], ['tv5monde'], ['tv5monde'], ['starworld'], ['channel'],
                       ['bestv', '鼎级'], ['东方', '电影'], ['靓妆'], ['科幻电影'], ['好莱坞', '电影'], ['怪物', '科幻'], ['漫威', '电影'],
                       ['灾难', '电影'], ['丧尸', '电影'], ['动漫', '大', '电影'], ['亚洲', '大', '电影'], ['亚洲', '好', '电影'],
                       ['bestv', '鼎级'], ['东方', '电影'], ['靓妆'], ['科幻电影'], ['好莱坞', '电影'], ['怪物', '科幻'], ['漫威', '电影'],
                       ['灾难', '电影'], ['丧尸', '电影'], ['动漫', '大', '电影'], ['亚洲', '大', '电影'], ['亚洲', '好', '电影'],
                       ['好莱坞', '片'], ['院线', '大片'], ['电影', '综合'], ['电影', '导视'], ['精品', '影院'], ['流金岁月'], ['情感', '影院'],
                       ['喜剧', '影院'], ['古装剧', '场'], ['骄阳', '剧场'], ['dox', '院线'], ['dox', '雅趣'], ['dox', '新知'],
                       ['dox', '新艺'], ['dox', '怡家'], ['dox', '英伦'], ['dox', '映画'], ['dox', '美剧'], ['doxtv'], ['迪斯尼'],
                       ['迪斯尼'], ['迪斯尼'], ['cn', '卡通'], ['cn', '卡通'], ['东森', '幼幼'], ['东森', '幼幼'], ['babyfirst'],
                       ['momo', '亲子', '台'], ['momo', '亲子', '台'], ['disney'], ['bestv4k'], ['纯享', '4k'], ['cctv4k'],
                       ['爱上', '4k'], ['第', '1', '集'], ['第', '2', '集'], ['第', '3', '集'], ['第', '4', '集'],
                       ['第', '5', '集'], ['第', '6', '集'], ['第', '7', '集'], ['第', '8', '集'], ['第', '9', '集'],
                       ['第', '10', '集'], ['第', '11', '集'], ['第', '12', '集'], ['第', '13', '集'], ['第', '14', '集'],
                       ['第', '15', '集'], ['第', '16', '集'], ['第', '17', '集'], ['第', '18', '集'], ['第', '19', '集'],
                       ['第', '20', '集'], ['第', '21', '集'], ['第', '22', '集'], ['第', '23', '集'], ['第', '24', '集'],
                       ['第', '25', '集'], ['第', '26', '集'], ['第', '27', '集'], ['第', '28', '集'], ['第', '29', '集'],
                       ['第', '30', '集'], ['第', '31', '集'], ['第', '32', '集'], ['第', '33', '集'], ['第', '34', '集'],
                       ['第', '35', '集'], ['第', '36', '集'], ['第', '37', '集'], ['第', '38', '集'], ['第', '39', '集'],
                       ['第', '40', '集'], ['第', '41', '集'], ['第', '42', '集'], ['第', '43', '集'], ['第', '44', '集'],
                       ['第', '45', '集'], ['第', '46', '集']]

        index_texts_without_dash = [['cctv', '1', '综合'], ['cctv', '2', '财经'], ['cctv', '3', '综艺'], ['cctv', '4', '国际'],
                                    ['cctv', '5', '体育'], ['cctv', '6'], ['cctv', '7', '军事', '农业'], ['cctv', '8'],
                                    ['cctv', '9', '纪录'], ['cctv', '10', '科教'], ['cctv', '11', '戏曲'],
                                    ['cctv', '12', '社会', '与', '法'], ['cctv', '13', '新闻'], ['cctv', '14', '少儿'],
                                    ['cctv', '15', '音乐'], ['cctv', '5', '+', '体育'], ['cctv', '17', '农村', '农业'],
                                    ['湖南卫视'], ['北京', '卫视'], ['浙江', '卫视'], ['江苏', '卫视'], ['东方', '卫视'], ['安徽', '卫视'],
                                    ['黑龙江', '卫视'], ['辽宁', '卫视'], ['深圳', '卫视'], ['广东', '卫视'], ['天津', '卫视'], ['湖北', '卫视'],
                                    ['山东', '卫视'], ['重庆', '卫视'], ['河南', '卫视'], ['陕西', '卫视'], ['吉林', '卫视'], ['广西', '卫视'],
                                    ['河北', '卫视'], ['西藏', '卫视'], ['内蒙古', '卫视'], ['青海', '卫视'], ['四川', '卫视'], ['山西', '卫视'],
                                    ['新疆', '卫视'], ['云南', '卫视'], ['江西', '卫视'], ['东南', '卫视'], ['贵州', '卫视'], ['甘肃', '卫视'],
                                    ['广东', '体育'], ['tvb', '无线', '新闻台'], ['tvb', '无线', '新闻台'], ['tvb', '无线', '新闻台'],
                                    ['tvb', '无线', '新闻台'], ['tvbs', '新闻'], ['tvbs', '新闻'], ['tvbs', '新闻'],
                                    ['tvbs', '新闻'], ['tvbs'], ['tvbs'], ['有线', '新闻台'], ['有线', '新闻台'], ['凤凰', '香港'],
                                    ['凤凰', '香港'], ['凤凰', '中文'], ['凤凰', '中文'], ['凤凰', '中文'], ['凤凰', '中文'], ['凤凰', '资讯'],
                                    ['凤凰', '资讯'], ['凤凰', '资讯'], ['凤凰', '资讯'], ['年代', '新闻'], ['年代', '新闻'], ['非凡', '新闻'],
                                    ['非凡', '新闻'], ['非凡', '新闻'], ['非凡', '新闻'], ['三立', '新闻'], ['三立', '新闻'], ['东森', '新闻'],
                                    ['东森', '新闻'], ['东森', '新闻'], ['东森', '新闻'], ['中', '天', '新闻'], ['中', '天', '新闻'],
                                    ['中', '天', '新闻'], ['壹', '新闻'], ['壹', '新闻'], ['寰宇', '新闻'], ['民视', '新闻'],
                                    ['民视', '新闻'], ['东森', '财经'], ['东森', '财经'], ['东森', '财经'], ['寰宇', '财经', '台'],
                                    ['耀才', '财经', '台'], ['澳亚', '卫视'], ['澳亚', '卫视'], ['香港', '开', '电视'], ['khs'],
                                    ['rthk31'], ['rthk31'], ['rhk32'], ['cnbc'], ['cnbc'], ['cnbc'], ['cnn'], ['cnn'],
                                    ['bbc'], ['bbc'], ['foxnews'], ['foxnews'], ['hbo', '原创', '电影'],
                                    ['hbo', '原创', '电影'], ['hbo', '家庭'], ['hbo', '家庭'], ['hbo', '强档'], ['hbo', '强档'],
                                    ['hbo'], ['hbo'], ['东森', '电影'], ['东森', '电影'], ['东森', '电影'], ['东森', '洋片'],
                                    ['靖天', '电影台'], ['龙华', '经典'], ['龙华', '影剧'], ['美亚', '电影'], ['美亚', '电影'],
                                    ['星卫', '电影台'], ['星卫', '电影'], ['卫视', '电影台'], ['纬来', '电影台'], ['纬来', '电影台'],
                                    ['fox', '电影'], ['fox', '电影'], ['fox', '动作', '电影'], ['fox', '动作', '电影'],
                                    ['fox', '动作', '电影'], ['采昌', '影剧'], ['tvb', '星河'], ['tvb', '星河'], ['tvb', '韩剧', '台'],
                                    ['華藝', '影剧', '台'], ['三立', '戏剧', '台'], ['纬来', '电影'], ['纬来', '戏剧'], ['纬来', '戏剧'],
                                    ['纬来', '戏剧'], ['eyetv', '戏剧', '台'], ['凤凰', '电影台'], ['凤凰', '电影台'], ['warnertv'],
                                    ['axn'], ['axn'], ['fx'], ['blueant'], ['好莱坞', '电影'], ['chc', '电影'],
                                    ['chc', '家庭', '电影'], ['chc', '动作', '电影'], ['tvb', 'j2'], ['tvb', '明珠', '台'],
                                    ['tvb', '明珠', '台'], ['tvb', '翡翠台'], ['tvb', '翡翠台'], ['tvb', '翡翠台'],
                                    ['tvbs', '欢乐', '台'], ['tvbs', '欢乐', '台'], ['tvbs', '欢乐', '台'], ['tvbs', '欢乐', '台'],
                                    ['tvbs', '精采', '台'], ['tvbs', '精采', '台'], ['tvbs', '精采', '台'], ['tvbs', '精采', '台'],
                                    ['公视'], ['公视'], ['民视', '台湾', '台'], ['公視', '3'], ['中视', '经典'], ['民视'], ['民视'],
                                    ['民视'], ['中视'], ['中视'], ['中视'], ['三立', '都', '会'], ['三立', '台湾'], ['八大', '综合'],
                                    ['八大', '综合'], ['八大', '第一'], ['八大', '第一'], ['jet', '综合'], ['jet', '综合'],
                                    ['三立', '综合', '台'], ['中', '天', '综合'], ['中', '天', '综合'], ['中', '天', '亚洲'],
                                    ['壹', '综合'], ['东森', '综合'], ['东森', '综合'], ['星空', '卫视'], ['tvn'], ['星卫', '娱乐'],
                                    ['foxsport', '3'], ['elta', '体育'], ['elta', '体育'], ['elta', '体育', '2'],
                                    ['elta', '体育', '3'], ['博斯', '高球', '1'], ['博斯', '高球', '1'], ['博斯', '高球', '1'],
                                    ['博斯', '高球', '2'], ['纬来', '体育'], ['纬来', '体育'], ['z', '频道'], ['star', 'sports'],
                                    ['国家', '地理', '野生'], ['国家', '地理', '野生'], ['国家', '地理'], ['国家', '地理'], ['国家', '地理'],
                                    ['探索频道'], ['探索', '亚洲'], ['探索', '亚洲'], ['探索', '科学'], ['探索', '科学'], ['动物', '星球'],
                                    ['动物', '星球'], ['动物', '星球'], ['动物', '星球'], ['tlc', '旅游', '生活'], ['tlc', '旅游', '生活'],
                                    ['亚洲', '旅游', '台'], ['年代', 'much'], ['年代', 'much'], ['美食', '星球'], ['smart'], ['mtv'],
                                    ['ftv'], ['fashion'], ['tv5monde'], ['tv5monde'], ['starworld'], ['channel'],
                                    ['bestv', '鼎级'], ['东方', '电影'], ['靓妆'], ['科幻电影'], ['好莱坞', '电影'], ['怪物', '科幻'],
                                    ['漫威', '电影'], ['灾难', '电影'], ['丧尸', '电影'], ['动漫', '大', '电影'], ['亚洲', '大', '电影'],
                                    ['亚洲', '好', '电影'], ['bestv', '鼎级'], ['东方', '电影'], ['靓妆'], ['科幻电影'], ['好莱坞', '电影'],
                                    ['怪物', '科幻'], ['漫威', '电影'], ['灾难', '电影'], ['丧尸', '电影'], ['动漫', '大', '电影'],
                                    ['亚洲', '大', '电影'], ['亚洲', '好', '电影'], ['好莱坞', '片'], ['院线', '大片'], ['电影', '综合'],
                                    ['电影', '导视'], ['精品', '影院'], ['流金岁月'], ['情感', '影院'], ['喜剧', '影院'], ['古装剧', '场'],
                                    ['骄阳', '剧场'], ['dox', '院线'], ['dox', '雅趣'], ['dox', '新知'], ['dox', '新艺'],
                                    ['dox', '怡家'], ['dox', '英伦'], ['dox', '映画'], ['dox', '美剧'], ['doxtv'], ['迪斯尼'],
                                    ['迪斯尼'], ['迪斯尼'], ['cn', '卡通'], ['cn', '卡通'], ['东森', '幼幼'], ['东森', '幼幼'],
                                    ['babyfirst'], ['momo', '亲子', '台'], ['momo', '亲子', '台'], ['disney'], ['bestv4k'],
                                    ['纯享', '4k'], ['cctv4k'], ['爱上', '4k'], ['第', '1', '集'], ['第', '2', '集'],
                                    ['第', '3', '集'], ['第', '4', '集'], ['第', '5', '集'], ['第', '6', '集'], ['第', '7', '集'],
                                    ['第', '8', '集'], ['第', '9', '集'], ['第', '10', '集'], ['第', '11', '集'],
                                    ['第', '12', '集'], ['第', '13', '集'], ['第', '14', '集'], ['第', '15', '集'],
                                    ['第', '16', '集'], ['第', '17', '集'], ['第', '18', '集'], ['第', '19', '集'],
                                    ['第', '20', '集'], ['第', '21', '集'], ['第', '22', '集'], ['第', '23', '集'],
                                    ['第', '24', '集'], ['第', '25', '集'], ['第', '26', '集'], ['第', '27', '集'],
                                    ['第', '28', '集'], ['第', '29', '集'], ['第', '30', '集'], ['第', '31', '集'],
                                    ['第', '32', '集'], ['第', '33', '集'], ['第', '34', '集'], ['第', '35', '集'],
                                    ['第', '36', '集'], ['第', '37', '集'], ['第', '38', '集'], ['第', '39', '集'],
                                    ['第', '40', '集'], ['第', '41', '集'], ['第', '42', '集'], ['第', '43', '集'],
                                    ['第', '44', '集'], ['第', '45', '集'], ['第', '46', '集']]

        simi_index = SimilarIndex(index_texts)

        channel_words1 = channel_name_participle('华数-10')
        q_lsi1 = simi_index.find_sims(channel_words1, model_type='lsi')  # 'CCTV' '-' '10': 0.9591 | '第' '10' '集': 0.6611
        q_tfidf1 = simi_index.find_sims(channel_words1,
                                        model_type='tfidf')  # 'CCTV' '-' '10': 0.6689 | '第' '10' '集': dash: 0.7618 no_dash 0.87
        channel_words2 = channel_name_participle('CETV-1')
        q_lsi2 = simi_index.find_sims(channel_words2, model_type='lsi')  # 'CCTV' '-' '1': 0.8426
        q_tfidf2 = simi_index.find_sims(channel_words2,
                                        model_type='tfidf')  # 'CCTV' '-' '1': 0.7509 | '第' '1' '集': 0.6818
        channel_words3 = channel_name_participle('CCTV-1 综合')
        q_lsi3 = simi_index.find_sims(channel_words3, model_type='lsi')  # 'CCTV' '-' '1' '综合': 0.9896
        q_tfidf3 = simi_index.find_sims(channel_words3, model_type='tfidf')  # 'CCTV' '-' '1' '综合': 1.0

        channel_words4 = channel_name_participle('CCTV-5+ 体育赛事')
        q_lsi4 = simi_index.find_sims(channel_words4,
                                      model_type='lsi')  # 'CCTV', '-', '5', '体育': 0.9931 | 'CCTV', '-', '5', '+', '体育': 0.9795
        q_tfidf4 = simi_index.find_sims(channel_words4,
                                        model_type='tfidf')  # 'CCTV', '-', '5', '体育': 0.7809, 0.63 | 'CCTV', '-', '5', '+', '体育': dash 0.92 nodash: 0.91
        channel_words5 = channel_name_participle('CCTV - 5 + 体育')
        q_lsi5 = simi_index.find_sims(channel_words5,
                                      model_type='lsi')  # 'CCTV', '-', '5', '体育': 0.9931
        q_tfidf5 = simi_index.find_sims(channel_words5,
                                        model_type='tfidf')  # 'CCTV', '-', '5', '体育': 0.7809

        channel_words7 = channel_name_participle('CCTV-7 国防军事 FHD')
        q_lsi7 = simi_index.find_sims(channel_words7,
                                      model_type='lsi')  # 'CCTV', '-', '7', '军事', '农业': 0.9281
        q_tfidf7 = simi_index.find_sims(channel_words7,
                                        model_type='tfidf')  # 'CCTV', '-', '7', '军事', '农业': dash 0.8640 nodash 0.8511
        channel_words8 = channel_name_participle('CCTV-8 电视剧 FHD')
        q_lsi8 = simi_index.find_sims(channel_words8,
                                      model_type='lsi')  # 'CCTV', '-', '8': 0.8991
        q_tfidf8 = simi_index.find_sims(channel_words8,
                                        model_type='tfidf')  # 'CCTV', '-', '8': dash 0.9999 nodash 1
        channel_words9 = channel_name_participle('东南卫视')
        q_lsi9 = simi_index.find_sims(channel_words9,
                                      model_type='lsi')  #
        q_tfidf9 = simi_index.find_sims(channel_words9,
                                        model_type='tfidf')  # '福建' '东南' '卫视':
        channel_words10 = channel_name_participle('凤凰 中文 移动1')
        q_lsi10 = simi_index.find_sims(channel_words10,
                                       model_type='lsi')  #
        q_tfidf10 = simi_index.find_sims(channel_words10,
                                         model_type='tfidf')  # '凤凰' '中文':
        channel_words11 = channel_name_participle('CCTV-4 美洲')
        q_lsi11 = simi_index.find_sims(channel_words11,
                                       model_type='lsi')  #
        q_tfidf11 = simi_index.find_sims(channel_words11,
                                         model_type='tfidf')  # 'CCTV' '-' '4' '国际': 0.75

        self.assertLess(q_tfidf1[9], DEFAULT_SIMILAR_THRESHOLD)
        self.assertGreaterEqual(q_tfidf7[6], DEFAULT_SIMILAR_THRESHOLD)


if __name__ == '__main__':
    unittest.main()
